app/controllers/concerns_controller.rb

SELECT "concerns".* FROM "concerns"
---
  def index
    @concerns = Concern.all

INSERT INTO "concerns" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Test Comment"], ["user_id", 1], ["created_at", 2017-02-09 20:43:37 UTC], ["updated_at", 2017-02-09 20:43:37 UTC]]
---
  def create
    @concern = Concern.new(concern_params)

    respond_to do |format|
      if @concern.save

SELECT  "concerns".* FROM "concerns" WHERE "concerns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_concern
      @concern = Concern.find(params[:id])